Диплом/src/Catalogs/ДеревянныеЩиты_Номенклатура/ДеревянныеЩиты_Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДеревянныеЩиты_Номенклатура</name>
  <attributes>
    <name>Сорт</name>
    <type>
      <types>EnumRef.Сорт</types>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипДеревянногоЩита</types>
    </type>
  </attributes>
  <attributes>
    <name>ДлинаВММ</name>
    <comment>Длина в миллиметрпах</comment>
    <type>
      <types>EnumRef.ДлинаЩита</types>
    </type>
  </attributes>
  <attributes>
    <name>ШиринаВММ</name>
    <comment>Ширина в мм щита</comment>
    <type>
      <types>EnumRef.ШиринаЩита</types>
    </type>
  </attributes>
  <attributes>
    <name>ТолщинаВММ</name>
    <comment>Толщина щита в мм</comment>
    <type>
      <types>EnumRef.ТолщинаЩита</types>
    </type>
  </attributes>
  <attributes>
    <name>МетрКвадратный</name>
    <comment>Метр квадратный</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МетрКубический</name>
    <comment>Метр кубический</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственноеЛицоСпецификации</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлПодпись</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Материалы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.РасходникиДляПроизводства_Номенклатура</types>
        <types>CatalogRef.ЛесСырьё_Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОсновнойМатериал</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>EnumRef.ЕдиницаИзмерения</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Диплом/src/Catalogs/ДеревянныеЩиты_Номенклатура/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура СортПриИзменении(Элемент)
	ОбновитьЩит();
КонецПроцедуры
&НаКлиенте
Процедура ТипПриИзменении(Элемент)
	ОбновитьЩит();
КонецПроцедуры
&НаКлиенте
Процедура ДлинаВММПриИзменении(Элемент)
	ОбновитьЩит();
	МетрКВ();
	МетрКуб();
КонецПроцедуры
&НаКлиенте
Процедура ШиринаВММПриИзменении(Элемент)
	ОбновитьЩит();
	МетрКВ(); 
	МетрКуб();
КонецПроцедуры
&НаКлиенте
Процедура ТолщинаВММПриИзменении(Элемент)
	ОбновитьЩит();
	МетрКуб();
КонецПроцедуры
&НаКлиенте
Процедура  ОбновитьЩит()
	        Объект.Наименование= Строка (Формат((Объект.Сорт), "ЧГ=")) + " " + Строка (Формат((Объект.Тип), "ЧГ=")) + " " + Строка (Формат((Объект.ДлинаВММ), "ЧГ=")) + "*" + Строка (Формат((Объект.ШиринаВММ), "ЧГ=")) + "*" + Строка (Формат((Объект.ТолщинаВММ), "ЧГ="));
КонецПроцедуры
&НаКлиенте
Процедура МетрКВ()
	   Объект.МетрКвадратный= (Строка (Формат((Объект.ДлинаВММ), "ЧГ="))*Строка (Формат((Объект.ШиринаВММ), "ЧГ=")))/1000000;
КонецПроцедуры
&НаКлиенте
Процедура МетрКуб()
	   Объект.МетрКубический= (Строка (Формат((Объект.ДлинаВММ), "ЧГ="))*Строка (Формат((Объект.ШиринаВММ), "ЧГ="))*Строка (Формат((Объект.ТолщинаВММ), "ЧГ=")))/1000000000;
КонецПроцедуры
&НаКлиенте
Процедура ЭлПодписьПриИзменении(Элемент)
	Если Объект.ЭлПодпись = Истина Тогда
		Элементы.Материалы.Доступность=Ложь;
		Элементы.ОтветственноеЛицоСпецификации.Доступность=Ложь;
	Иначе
		Элементы.Материалы.Доступность=Истина;
		Элементы.ОтветственноеЛицоСпецификации.Доступность=Истина;
	КонецЕсли;
КонецПроцедуры
